# Taps
tap 'homebrew/bundle'

# Binaries, dependencies and system package updates
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'yarn'

# Personal
brew 'neovim'
brew 'bat'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'fd'
brew 'jq' 
brew 'zoxide'
brew 'yazi'
brew 'fzf'
brew 'ripgrep'
brew 'pure'
brew 'eza'
brew 'htop'
brew 'gh'
brew 'stow'
brew 'tldr'
brew 'xh'
brew 'httpie'
brew 'atuin'
brew '1password-cli'
brew 'lazygit'
brew 'lazydocker'
brew 'neofetch'
brew 'tree'
brew 'xan'

# Casks 
cask 'arc'
cask 'firefox'
cask 'obsidian'
cask 'linearmouse'
cask 'raycast'
cask 'nikitabobko/tap/aerospace'
cask 'zed'
cask 'ghostty'

# Work Apps
cask '1password'
cask 'caffeine'
# pick one - would not recommend installing both podman and docker at the same time 
#cask 'docker'
cask 'podman'
cask 'slack'
cask 'tableplus'
cask 'transmit'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-caskaydia-mono-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store - left as an example
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'MyWoosh', id: 1498889644
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696
