# Taps
tap 'homebrew/bundle'

# Binaries, dependencies and system package updates
brew 'ffmpeg'
brew 'git'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Development
brew 'imagemagick'
brew 'yarn'

# Personal
brew 'neovim'
brew 'bat'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'fd'
brew 'jq' 
brew 'zoxide'
brew 'yazi'
brew 'fzf'
brew 'ripgrep'
brew 'pure'
brew 'eza'
brew 'htop'
brew 'gh'
brew 'stow'
brew 'tldr'
brew 'xh'
brew 'httpie'
brew 'atuin'
brew 'lazygit'
brew 'lazydocker'
brew 'neofetch'
brew 'tree'
brew 'xan'


