# Taps
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq' 
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Development
brew 'imagemagick'
brew 'yarn'

# Personal
brew 'neovim'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'fd'
brew 'zoxide'
brew 'yazi'
brew 'fzf'
brew 'ripgrep'
brew 'pure'

cask 'iterm2'
cask 'alt-tab'
cask 'maccy'
cask 'alfred'
cask 'obsidian'
cask 'bruno'
cask 'arc'

# Apps
cask '1password'
cask 'caffeine'
cask 'docker'
cask 'github'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
# cask 'tuple'
cask 'visual-studio-code'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-caskaydia-mono-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store - left as an example
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'MyWoosh', id: 1498889644
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696
